In [1]:
import pandas as pd

In [12]:
training_csv = 'test.csv'
test_csv = 'train.csv'

no_touch_train = pd.read_csv(training_csv)
no_touch_test = pd.read_csv(test_csv)

training_data = no_touch_train
testing_data = no_touch_test

training_data.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [13]:
testing_data.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [21]:
training_data['Name_title'] = training_data.Name.apply(lambda x: x.split(',')[1].split('.')[0].strip())
testing_data['Name_title'] = testing_data.Name.apply(lambda x: x.split(',')[1].split('.')[0].strip())

training_data['Title_num'] = training_data.Name.apply(lambda x: x.split(',')[1].split('.')[0].strip())
testing_data['Title_num'] = testing_data.Name.apply(lambda x: x.split(',')[1].split('.')[0].strip())

In [44]:
training_data['Title_num'] = training_data['Title_num'].replace('Mr',1)
training_data['Title_num'] = training_data['Title_num'].replace('Mrs',2)
training_data['Title_num'] = training_data['Title_num'].replace(['Miss','Mlle','Ms','Mme'],3)
training_data['Title_num'] = training_data['Title_num'].replace(['Major','Col','Capt'],4)
training_data['Title_num'] = training_data['Title_num'].replace(['Master','Don','Rev','Dr','Lady','Sir','the Countess','Jonkheer','Dona'],5)
# training_data.head(1)

testing_data['Title_num'] = testing_data['Title_num'].replace('Mr',1)
testing_data['Title_num'] = testing_data['Title_num'].replace('Mrs',2)
testing_data['Title_num'] = testing_data['Title_num'].replace(['Miss','Mlle','Ms','Mme'],3)
testing_data['Title_num'] = testing_data['Title_num'].replace(['Major','Col','Capt'],4)
testing_data['Title_num'] = testing_data['Title_num'].replace(['Master','Don','Rev','Dr','Lady','Sir','the Countess','Jonkheer','Dona'],5)
testing_data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name_title,Title_num,Sex_binary,Age_imp_median,Age_imp_mean,Cabin_decks
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Mr,1,0,22.0,22.0,NaN

In [45]:
# making sex binary
training_data['Sex_binary'] = [0 if x == 'male' else 1 for x in training_data['Sex']]
# making sex binary
testing_data['Sex_binary'] = [0 if x == 'male' else 1 for x in testing_data['Sex']]

In [46]:
# adding age for mean and median
train_mean = training_data.Age.mean()
train_median = training_data.Age.median()

training_data["Age_imp_median"] = training_data.Age.fillna(train_median)
training_data["Age_imp_mean"] = training_data.Age.fillna(train_mean)

# adding age for mean and median
test_mean = testing_data.Age.mean()
test_median = testing_data.Age.median()

testing_data["Age_imp_median"] = testing_data.Age.fillna(test_median)
testing_data["Age_imp_mean"] = testing_data.Age.fillna(test_mean)

In [47]:
# cleaning cabin - moving to decks
training_data['Cabin_decks'] = training_data['Cabin'].str.replace('\d+','')
training_data['Cabin_decks'] = training_data['Cabin_decks'].replace(['NaN'],'N')

testing_data['Cabin_decks'] = testing_data['Cabin'].str.replace('\d+','')
testing_data['Cabin_decks'] = testing_data['Cabin_decks'].replace(['NaN'],'N')

In [48]:
training_data.head(1)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name_title,Title_num,Sex_binary,Age_imp_median,Age_imp_mean,Cabin_decks
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,Mr,1,0,34.5,34.5,NaN

In [49]:
testing_data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name_title,Title_num,Sex_binary,Age_imp_median,Age_imp_mean,Cabin_decks
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Mr,1,0,22.0,22.0,NaN

In [50]:
testing_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Name_title',
       'Title_num', 'Sex_binary', 'Age_imp_median', 'Age_imp_mean',
       'Cabin_decks'],
      dtype='object')

In [51]:
X_train = training_data[['SibSp','Parch','Fare','Title_num',\
            'Sex_binary','Age_imp_median']]
X_test = testing_data[['SibSp','Parch','Fare','Title_num',\
            'Sex_binary','Age_imp_median']]

y_test = testing_data['Survived']

In [52]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaler.fit(X_train)

X_train = scaler.transform(X_train)
X_test = scaler.transform(X_test)

In [53]:
from sklearn.neighbors import KNeighborsClassifier
classifier = KNeighborsClassifier(n_neighbors=5)
classifier.fit(X_train, y_train)

NameError: name 'y_train' is not defined